AwangLL/AwangKeyboard/2-Firmware/fw-nrf52SDK/src/usb/usb_custom_service.c
#include "usb_custom_service.h"
#include <stdint.h>
#include "nrf_drv_clock.h"
#include "nrf_drv_power.h"
#include "nrf_drv_usbd.h"

#include "ble/ble_service.h"
#include "keyboard_evt.h"
#include "keyboard_report.h"

#include "config.h"
#include "kb_nrf_print.h"
#include "nrf_delay.h"

/**
 * @brief Enable power USB detection
 *
 * Configure if example supports USB port connection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif

static bool m_send_flag = 0;
static uint8_t _usb_state = USB_STATE_NOT_CONNECT;
static uint8_t rxBuf[1 + 3]; // report id (1 byte) + dataType/ledState(1 byte) + dataValue(2 byte)

static nrf_drv_usbd_transfer_t transfer_out1 = {
    .p_data = {.rx = rxBuf},
    .size = 1 + 3,
    .flags = 0};

/**
 * @brief USB configured flag
 *
 * The flag that is used to mark the fact that USB is configured and ready
 * to transmit data
 */
static volatile bool m_usbd_configured = false;

/**
 * @brief USB suspended
 *
 * The flag that is used to mark the fact that USB is suspended and requires wake up
 * if new data is available.
 *
 * @note This variable is changed from the main loop.
 */
static bool m_usbd_suspended = false;

/**
 * @brief Mark the fact if remote wake up is enabled
 *
 * The internal flag that marks if host enabled the remote wake up functionality in this device.
 */
static
#if REMOTE_WU
    volatile // Disallow optimization only if Remote wakeup is enabled
#endif
    bool m_usbd_rwu_enabled = false;

/**
 * @brief System OFF request flag
 *
 * This flag is used in button event processing and marks the fact that
 * system OFF should be activated from main loop.
 */
static volatile bool m_system_off_req = false;

/**
 * @brief The requested suspend state
 *
 * The currently requested suspend state based on the events
 * received from USBD library.
 * If the value here is different than the @ref m_usbd_suspended
 * the state changing would be processed inside main loop.
 */
static volatile bool m_usbd_suspend_state_req = false;

/** Device descriptor **/
#define EP0_MAXPACKETSIZE NRF_DRV_USBD_EPSIZE // Maximum size of the packed transfered by EP0
#define USBD_STRING_LANG_IX 0x00
#define USBD_STRING_MANUFACTURER_IX 0x01
#define USBD_STRING_PRODUCT_IX 0x02
#define USBD_STRING_SERIAL_IX 0x00
static const uint8_t usb_device_descriptor[] = {
    0x12,                        // bLength | size of descriptor
    0x01,                        // bDescriptorType | descriptor type
    0x00, 0x02,                  // bcdUSB | USB spec release (ver 2.0)
    0x00,                        // bDeviceClass ¦ class code (each interface specifies class information)
    0x00,                        // bDeviceSubClass ¦ device sub-class (must be set to 0 because class code is 0)
    0x00,                        // bDeviceProtocol | device protocol (no class specific protocol)
    EP0_MAXPACKETSIZE,           // bMaxPacketSize0 | maximum packet size (64 bytes)
    0x15, 0x19,                  // vendor ID
    0xEE, 0xEE,                  // product ID
    0x00, 0x01,                  // bcdDevice | final device release number in BCD Format
    USBD_STRING_MANUFACTURER_IX, // iManufacturer | index of manufacturer string
    USBD_STRING_PRODUCT_IX,      // iProduct | index of product string
    USBD_STRING_SERIAL_IX,       // iSerialNumber | Serial Number string
    0x01                         // bNumConfigurations | number of configurations
};

/** Report descriptor **/
static const uint8_t kbd_report_descriptor[] = {
    0x05, 0x01, // Usage Page (Generic Desktop)
    0x09, 0x06, // Usage (Keyboard)
    0xA1, 0x01, // Collection (Application)
    0x85, INPUT_REPORT_KEYBOARD_ID, // Report ID (1)

    0x95, 0x08, // Report Count (8)
    0x75, 0x01, // Report Size (1)
    0x05, 0x07, // Usage Page (Key Codes)
    0x19, 0xe0, // Usage Minimum (224)
    0x29, 0xe7, // Usage Maximum (231)
    0x15, 0x00, // Logical Minimum (0)
    0x25, 0x01, // Logical Maximum (1)
    0x81, 0x02, // Input (Data, Variable, Absolute)

    0x95, 0x01, // Report Count (1)
    0x75, 0x08, // Report Size (8)
    0x81, 0x03, // Input (Constant, Variable, Absolute) reserved byte(1)

    0x95, 0x66, // Report Count (102)
    0x75, 0x01, // Report Size (1)
    0x19, 0x00, // Usage Minimum (0)
    0x29, 0x65, // Usage Maximum (101)
    0x15, 0x00, // Logical Minimum (0)
    0x25, 0x01, // Logical Maximum (1)
    0x81, 0x02, // Input (Data, Variable, Absolute)
    0x95, 0x01, // Report Count (2)
    0x75, 0x02, // Report Size (1)
    0x81, 0x03, // Input (Constant, Variable, Absolute) reserved byte(1)

    0x95, 0x05, // Report Count (5)
    0x75, 0x01, // Report Size (1)
    0x15, 0x00, // Logical Minimum (0)
    0x25, 0x01, // Logical Maximum (1)
    0x05, 0x08, // Usage Page (Page# for LEDs)
    0x19, 0x01, // Usage Minimum (1) (Num Lock)
    0x29, 0x05, // Usage Maximum (5) (Kana)
    0x91, 0x02, // Output (Data, Variable, Absolute), Led report
    0x95, 0x01, // Report Count (1)
    0x75, 0x03, // Report Size (3)
    0x91, 0x03, // Output (Const, Variable, Absolute), Led report padding

    0xC0, // End Collection (Application)

    0x05, 0x0C, // Usage Page (Consumer Devices)
    0x09, 0x01, // Usage (Consumer Control)
    0xA1, 0x01, // Collection (Application)
    0x85, INPUT_REPORT_CONSUMER_ID, //   Report ID (2)

    0x95, 0x01,       // Report Count (1)
    0x75, 0x10,       // Report Size (16)
    0x19, 0x01,       // Usage Minimum (0x01)
    0x2A, 0x9C, 0x02, // Usage Maximum (0x29c)
    0x15, 0x01,       // Logical Minimum (0x01)
    0x26, 0x9C, 0x02, // Logical Maximum (0x29c)
    0x81, 0x00,       // Input (Data, Array) Key array(2 bytes)
    0xC0,             // End Collection (Application)

    0x09, 0x00, // Usage (0)
    0xA1, 0x01, // Collection (Application)
    0x85, INPUT_REPORT_CUSTOM_ID, // Report ID (3)

    0x95, 0x03, // Report Count (3)
    0x75, 0x08, // Report Size (8)
    0x19, 0x01, // Usage Minimum (1)
    0x29, 0x08, // Usage Maximum (8)
    0x15, 0x00, // Logical Minimum (0)
    0x25, 0xFF, // Logical Maximum (255)
    0x81, 0x02, // Input (Data, Variable, Absolute)
    0x91, 0x03, // Output (Data, Variable, Absolute)
    0xC0
};

