AwangLL/AwangKeyboard/2-Firmware/fw-nrf52SDK/src/usb/usb_custom_service.c
/** Configuration descriptor **/
#define DEVICE_SELF_POWERED 1
#define REMOTE_WU 1
#define USBD_CONFIG_DESCRIPTOR_SIZE 9
static const uint8_t usb_configuration_descriptor[9 + 9 + 9 + 7 + 7] = {
    /* configuration descriptor */
    0x09,                                                 // bLength | length of descriptor
    0x02,                                                 // bDescriptorType | descriptor type (CONFIGURATION)
    sizeof(usb_configuration_descriptor) & 0xff,          // wTotalLength | total length of descriptor(s) low
    (sizeof(usb_configuration_descriptor) >> 8) & 0xff,   // wTotalLength | total length of descriptor(s) high
    0x01,                                                 // bNumInterfaces
    0x01,                                                 // bConfigurationValue
    0x00,                                                 // index of string Configuration | configuration string index (not supported)
    0x80 | (DEVICE_SELF_POWERED << 6) | (REMOTE_WU << 5), // bmAttributes
    0xFA,                                                 // maximum power in steps of 2mA (500mA)
    /* interface descriptor */
    0x09, // bLength
    0x04, // bDescriptorType | descriptor type (INTERFACE)
    0x00, // bInterfaceNumber
    0x00, // bAlternateSetting
    0x02, // bNumEndpoints | number of endpoints (2)
    0x03, // bInterfaceClass | interface class (3..defined by USB spec: HID)
    0x00, // bInterfaceSubClass |interface sub-class (0.. no boot interface)
    0x00, // bInterfaceProtocol | interface protocol (0.. none) 
    0x00, // interface string index (not supported)
    /* hid descriptor */
    0x09,                                        // bLength | length of descriptor (9 bytes)
    0x21,                                        // bHIDDescriptor | descriptor type (HID)
    0x11, 0x01,                                  // HID wBcdHID | Spec version 01.11
    0x00,                                        // bCountryCode | HW Target country
    0x01,                                        // bNumDescriptors | Number of HID class descriptors to follow
    0x22,                                        // bDescriptorType | Report descriptor type is 0x22 (report)
    sizeof(kbd_report_descriptor) & 0xff,        // Total length of Report descr., low byte
    (sizeof(kbd_report_descriptor) >> 8) & 0xff, // Total length of Report descr., high byte
    /* endpoint descriptor (in)*/
    0x07,       // bLength | length of descriptor (7 bytes)
    0x05,       // bDescriptorType | descriptor type (ENDPOINT)
    0x81,       // bEndpointAddress | endpoint address (IN endpoint, endpoint 1)
    0x03,       // bmAttributes | endpoint attributes (interrupt)
    0x10, 0x00, // bMaxPacketSizeLowByte,bMaxPacketSizeHighByte | maximum packet size (16 bytes)
    0x0A,       // bInterval | polling interval (10ms)
    /* endpoint descriptor (out)*/
    0x07,       // bLength | length of descriptor (7 bytes)
    0x05,       // bDescriptorType | descriptor type (ENDPOINT)
    0x01,       // bEndpointAddress | endpoint address (OUT endpoint, endpoint 1)
    0x03,       // bmAttributes | endpoint attributes (interrupt)
    0x10, 0x00, // bMaxPacketSizeLowByte,bMaxPacketSizeHighByte | maximum packet size (16 bytes)
    0x0A,       // bInterval | polling interval (10ms)
};
static const uint8_t *usb_interface0_descriptor = &usb_configuration_descriptor[9];
static const uint8_t *usb_hid0_descriptor = &usb_configuration_descriptor[9 + 9];
static const uint8_t *usb_endpoint1_in_descriptor = &usb_configuration_descriptor[9 + 9 + 9];
static const uint8_t *usb_endpoint1_out_descriptor = &usb_configuration_descriptor[9 + 9 + 9 + 7];

/** String descriptor **/
const static uint8_t usb_string_lang[] = {
    0x04, // length of descriptor
    0x03, // descriptor type
    0x09,
    0x04 // Supported LangID = 0x0409 (US-English) */
};
const static uint8_t usb_string_manufacturer[] = {
    14,        // length of descriptor (? bytes)
    0x03,      // descriptor type
    'N', 0x00, // Define Unicode String "Nordic"
    'o', 0x00, //
    'r', 0x00, //
    'd', 0x00, //
    'i', 0x00, //
    'c', 0x00, //
};
const static uint8_t usb_string_product[] = {
    30,        // length of descriptor (? bytes)
    0x03,      // descriptor type
    'A', 0x00, // generic unicode string for all devices : A
    'w', 0x00, // w
    'a', 0x00, // a
    'n', 0x00, // n
    'g', 0x00, // g
    ' ', 0x00, //
    'k', 0x00, // k
    'e', 0x00, // e
    'y', 0x00, // y
    'b', 0x00, // b
    'o', 0x00, // o
    'a', 0x00, // a
    'r', 0x00, // r
    'd', 0x00, // d
};

static const uint8_t get_config_resp_configured[] = {1};
static const uint8_t get_config_resp_unconfigured[] = {0};

static const uint8_t get_status_device_resp_nrwu[] = {
    ((DEVICE_SELF_POWERED) ? 1 : 0), // LSB first: self-powered, no remoteWk
    0};
static const uint8_t get_status_device_resp_rwu[] = {
    ((DEVICE_SELF_POWERED) ? 1 : 0) | 2, // LSB first: self-powered, remoteWk
    0};

static const uint8_t get_status_interface_resp[] = {0, 0};
static const uint8_t get_status_ep_halted_resp[] = {1, 0};
static const uint8_t get_status_ep_active_resp[] = {0, 0};

/**
 * @brief Setup all the endpoints for selected configuration
 *
 * Function sets all the endpoints for specific configuration.
 *
 * @note
 * Setting the configuration index 0 means technically disabling the HID interface.
 * Such configuration should be set when device is starting or USB reset is detected.
 *
 * @param index Configuration index
 *
 * @retval NRF_ERROR_INVALID_PARAM Invalid configuration
 * @retval NRF_SUCCESS             Configuration successfully set
 */
static ret_code_t ep_configuration(uint8_t index)
{
    kb_print("index = %d", index);
    if (index == 1)
    {
        nrf_drv_usbd_ep_dtoggle_clear(NRF_DRV_USBD_EPIN1);
        nrf_drv_usbd_ep_stall_clear(NRF_DRV_USBD_EPIN1);
        nrf_drv_usbd_ep_dtoggle_clear(NRF_DRV_USBD_EPOUT1);
        nrf_drv_usbd_ep_dtoggle_clear(NRF_DRV_USBD_EPOUT1);
        nrf_drv_usbd_ep_enable(NRF_DRV_USBD_EPIN1);
        nrf_drv_usbd_ep_enable(NRF_DRV_USBD_EPOUT1);

        kb_print("m_usbd_configured = true;");
        m_usbd_configured = true;
        nrf_drv_usbd_setup_clear();

