AwangLL/AwangKeyboard/2-Firmware/fw-nrf52SDK/src/usb/usb_custom_service.c
        ble_disconnect();
        _usb_state = USB_STATE_WORKING;
        keyboard_evt_trigger_param(KBD_EVT_USB, USB_STATE_WORKING);
    }
    else if (index == 0)
    {
        nrf_drv_usbd_ep_disable(NRF_DRV_USBD_EPIN1);
        m_usbd_configured = false;
        nrf_drv_usbd_setup_clear();
    }
    else
    {
        return NRF_ERROR_INVALID_PARAM;
    }
    return NRF_SUCCESS;
}

/**
 * @name Processing setup requests
 *
 * @{
 */
/**
 * @brief Respond on ep 0
 *
 * Auxiliary function for sending respond on endpoint 0
 * @param[in] p_setup Pointer to setup data from current setup request.
 *                    It would be used to calculate the size of data to send.
 * @param[in] p_data  Pointer to the data to send.
 * @param[in] size    Number of bytes to send.
 * @note Data pointed by p_data has to be available till the USBD_EVT_BUFREADY event.
 */
static void respond_setup_data(
    nrf_drv_usbd_setup_t const *const p_setup,
    void const *p_data, size_t size)
{
    /* Check the size against required response size */
    if (size > p_setup->wLength)
    {
        size = p_setup->wLength;
    }
    ret_code_t ret;
    nrf_drv_usbd_transfer_t transfer =
        {
            .p_data = {.tx = p_data},
            .size = size};
    ret = nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPIN0, &transfer);
    if (ret != NRF_SUCCESS)
    {
        kb_print("Transfer starting failed: %d", (uint32_t)ret);
    }
    ASSERT(ret == NRF_SUCCESS);
    UNUSED_VARIABLE(ret);
}

static void usbd_setup_ClearFeature(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("clear feature request");
    if ((p_setup->bmRequestType) == 0x02) // standard request, recipient=endpoint
    {
        if ((p_setup->wValue) == 0)
        {
            if ((p_setup->wIndex) == NRF_DRV_USBD_EPIN1)
            {
                nrf_drv_usbd_ep_stall_clear(NRF_DRV_USBD_EPIN1);
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    else if ((p_setup->bmRequestType) == 0x00) // standard request, recipient=device
    {
        if (REMOTE_WU)
        {
            if ((p_setup->wValue) == 1) // Feature Wakeup
            {
                m_usbd_rwu_enabled = false;
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    kb_print("Unknown feature to clear");
    nrf_drv_usbd_setup_stall();
}
static void usbd_setup_SetFeature(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("set feature request");
    if ((p_setup->bmRequestType) == 0x02) // standard request, recipient=endpoint
    {
        if ((p_setup->wValue) == 0) // Feature HALT
        {
            if ((p_setup->wIndex) == NRF_DRV_USBD_EPIN1)
            {
                nrf_drv_usbd_ep_stall(NRF_DRV_USBD_EPIN1);
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    else if ((p_setup->bmRequestType) == 0x0) // standard request, recipient=device
    {
        if (REMOTE_WU)
        {
            if ((p_setup->wValue) == 1) // Feature Wakeup
            {
                m_usbd_rwu_enabled = true;
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    kb_print("Unknown feature to set");
    nrf_drv_usbd_setup_stall();
}
static void usbd_setup_GetDescriptor(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("get descriptor request");
    // determine which descriptor has been asked for
    switch ((p_setup->wValue) >> 8)
    {
    case 1: // Device
        kb_print("get device descriptor");
        respond_setup_data(
            p_setup,
            usb_device_descriptor,
            sizeof(usb_device_descriptor));
        return;
    case 2: // Configuration
        kb_print("get configuration descriptor");
        respond_setup_data(
            p_setup,
            usb_configuration_descriptor,
            sizeof(usb_configuration_descriptor));
        return;
    case 3: // String
        // Select the string
        switch ((p_setup->wValue) & 0xFF)
        {
        case USBD_STRING_LANG_IX:
            kb_print("get string descriptor - lang");
            respond_setup_data(
                p_setup,
                usb_string_lang,
                sizeof(usb_string_lang));
            return;
        case USBD_STRING_MANUFACTURER_IX:
            kb_print("get string descriptor - manufacturer");
            respond_setup_data(
                p_setup,
                usb_string_manufacturer,
                sizeof(usb_string_manufacturer));
            return;
        case USBD_STRING_PRODUCT_IX:
            kb_print("get string descriptor - product");
            respond_setup_data(
                p_setup,
                usb_string_product,
                sizeof(usb_string_product));
            return;
        default:
            break;
        }
        break;
    case 4: // Interface
        // Which interface?
        kb_print("get interface descriptor");
        if ((((p_setup->wValue) & 0xFF) == 0))
        {
            respond_setup_data(
                p_setup,
                usb_interface0_descriptor,
                9);
            return;
        }
        break;
    case 5: // Endpoint
        // Which endpoint?
        kb_print("get endpoint descriptor");
        if (((p_setup->wValue) & 0xFF) == 1)
        {
            // kb_print("endpoint wLength:%d",p_setup->wLength);
            respond_setup_data(
                p_setup,
                usb_endpoint1_in_descriptor,
                7);
            return;
        }
        else
        {
            // kb_print("unknown endpoint request wValue:%2x, wLength:%d",p_setup->wValue & 0xFF,p_setup->wLength);
        }
        break;
    case 0x21: // HID
        kb_print("get HID descriptor");
        if ((p_setup->bmRequestType) == 0x81)
        {
            // Which interface
            if (((p_setup->wValue) & 0xFF) == 0)
            {
                respond_setup_data(
                    p_setup,
                    usb_hid0_descriptor,
                    9);
                return;
            }
        }
        break;
    case 0x22: // HID report
        kb_print("get HID report descriptor");
        if ((p_setup->bmRequestType) == 0x81)
        {
            // Which interface?
            if (((p_setup->wValue) & 0xFF) == 0)
            {
                respond_setup_data(
                    p_setup,
                    kbd_report_descriptor,
                    sizeof(kbd_report_descriptor));
                return;
            }
        }
        break;
    default:
        break; // Not supported - go to stall
    }
    kb_print("Unknown descriptor requested: 0x%2x, type: 0x%2x or value: 0x%2x",
             p_setup->wValue >> 8,
             p_setup->bmRequestType,
             p_setup->wValue & 0xFF);
    nrf_drv_usbd_setup_stall();
}
static void usbd_setup_GetConfig(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("get config request");
    if (m_usbd_configured)
    {
        respond_setup_data(
            p_setup,
            get_config_resp_configured,
            sizeof(get_config_resp_configured));
    }
    else
    {
        respond_setup_data(
            p_setup,
            get_config_resp_unconfigured,
            sizeof(get_config_resp_unconfigured));
    }
}
static void usbd_setup_SetConfig(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("set config request");
    if ((p_setup->bmRequestType) == 0x00)
    {
        // accept only 0 and 1
        if (((p_setup->wIndex) == 0) && ((p_setup->wLength) == 0) &&
            ((p_setup->wValue) <= UINT8_MAX))
        {
            if (NRF_SUCCESS == ep_configuration((uint8_t)(p_setup->wValue)))
            {
                nrf_drv_usbd_setup_clear();
                return;
            }
        }
    }
    kb_print("Wrong configuration: Index: 0x%2x, Value: 0x%2x.",
             p_setup->wIndex,
             p_setup->wValue);
    nrf_drv_usbd_setup_stall();
}
static void usbd_setup_SetIdle(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("set idle request");
    nrf_drv_usbd_setup_clear();
}
static void usbd_setup_SetInterface(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("set interface request");
    // no alternate setting is supported - STALL always
    kb_print("No alternate interfaces supported.");
    nrf_drv_usbd_setup_stall();
}
static void usbd_setup_SetProtocol(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("set protocol request");
    nrf_drv_usbd_setup_clear();
}
static void usbd_setup_GetStatus(nrf_drv_usbd_setup_t const *const p_setup)
{
    kb_print("get status request");
    switch (p_setup->bmRequestType)
    {
    case 0x80: // Device
        if (((p_setup->wIndex) & 0xff) == 0)
        {
            respond_setup_data(
                p_setup,
                m_usbd_rwu_enabled ? get_status_device_resp_rwu : get_status_device_resp_nrwu,
                sizeof(get_status_device_resp_nrwu));
            return;
        }
        break;
    case 0x81:                 // Interface
        if (m_usbd_configured) // Respond only if configured
        {
            if (((p_setup->wIndex) & 0xff) == 0) // Only interface 0 supported
            {
                respond_setup_data(
                    p_setup,
                    get_status_interface_resp,
                    sizeof(get_status_interface_resp));
                return;
            }
        }
        break;
    case 0x82:                               // Endpoint
        if (((p_setup->wIndex) & 0xff) == 0) // Endpoint 0
        {
            respond_setup_data(
                p_setup,
                get_status_ep_active_resp,
                sizeof(get_status_ep_active_resp));
            return;
        }
        if (m_usbd_configured) // Other endpoints responds if configured
        {
            if (((p_setup->wIndex) & 0xff) == NRF_DRV_USBD_EPIN1)
            {
                if (nrf_drv_usbd_ep_stall_check(NRF_DRV_USBD_EPIN1))
                {
                    respond_setup_data(
                        p_setup,
                        get_status_ep_halted_resp,
                        sizeof(get_status_ep_halted_resp));
                    return;
                }
                else
                {
                    respond_setup_data(
                        p_setup,
                        get_status_ep_active_resp,
                        sizeof(get_status_ep_active_resp));
                    return;
                }
            }
        }
        break;
    default:
        break; // Just go to stall
    }
    kb_print("Unknown status: 0x%2x", p_setup->bmRequestType);
    nrf_drv_usbd_setup_stall();
}
/** @} */ /* End of processing setup requests functions */

