AwangLL/AwangKeyboard/2-Firmware/fw-nrf52SDK/src/usb/usb_custom_service.c
static void power_usb_event_handler(nrf_drv_power_usb_evt_t event)
{
    switch (event)
    {
    case NRF_DRV_POWER_USB_EVT_DETECTED:
        if (!nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_enable();
        }
        _usb_state = USB_STATE_POWER_CONNECT;
        keyboard_evt_trigger_param(KBD_EVT_USB, USB_STATE_POWER_CONNECT);
        break;
    case NRF_DRV_POWER_USB_EVT_REMOVED:
        kb_print("USB power removed");
        advertising_start(false);
        m_usbd_configured = false;
        if (nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_stop();
        }
        if (nrf_drv_usbd_is_enabled())
        {
            nrf_drv_usbd_disable();
        }
        _usb_state = USB_STATE_NOT_CONNECT;
        keyboard_evt_trigger_param(KBD_EVT_USB, USB_STATE_NOT_CONNECT);
        break;
    case NRF_DRV_POWER_USB_EVT_READY:
        kb_print("USB ready");
        if (!nrf_drv_usbd_is_started())
        {
            nrf_drv_usbd_start(true);
        }
        break;
    default:
        // ASSERT(false);
        break;
    }
}

static void usbd_event_handler(nrf_drv_usbd_evt_t const *const p_event)
{
    switch (p_event->type)
    {
    case NRF_DRV_USBD_EVT_SUSPEND:
        kb_print("SUSPEND state detected");
        m_usbd_suspend_state_req = true;
        break;
    case NRF_DRV_USBD_EVT_RESUME:
        kb_print("RESUMING from suspend");
        m_usbd_suspend_state_req = false;
        break;
    case NRF_DRV_USBD_EVT_WUREQ:
        kb_print("RemoteWU initiated");
        m_usbd_suspend_state_req = false;
        break;
    case NRF_DRV_USBD_EVT_RESET:
    {
        ret_code_t ret = ep_configuration(0);
        ASSERT(ret == NRF_SUCCESS);
        UNUSED_VARIABLE(ret);
        m_usbd_suspend_state_req = false;
        break;
    }
    case NRF_DRV_USBD_EVT_SOF:
    {
        static uint32_t cycle = 0;
        ++cycle;
        if ((cycle % (m_usbd_configured ? 500 : 100)) == 0)
        {
            // bsp_board_led_invert(LED_USB_STATUS);
        }
        break;
    }
    case NRF_DRV_USBD_EVT_EPTRANSFER:
        if (NRF_DRV_USBD_EPIN1 == p_event->data.eptransfer.ep)
        {
            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                /* Transfer ok - allow status stage */
                nrf_drv_usbd_setup_clear();
            }
            else if (NRF_USBD_EP_ABORTED == p_event->data.eptransfer.status)
            {
                /* Just ignore */
                kb_print("Transfer aborted event on EPIN1");
            }
            else
            {
                kb_print("Transfer failed on EPIN1: %d", p_event->data.eptransfer.status);
                nrf_drv_usbd_setup_stall();
            }
        }
        else if (NRF_DRV_USBD_EPOUT1 == p_event->data.eptransfer.ep)
        {
            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                /* Transfer ok - allow status stage */

                kb_error(nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPOUT1,
                                                  &transfer_out1));                                                ;
                if(rxBuf[0] == OUTPUT_REPORT_KEYBOARD_ID)
                {
                    kb_print("led state:%2x",rxBuf[1]);
                }
                else if(rxBuf[0] == OUTPUT_REPORT_CUSTOM_ID)
                {
                    kb_print("data type:%2x, data value:%4x",rxBuf[1],rxBuf[2] + ((uint16_t)rxBuf[3]<<8));
                }

                nrf_drv_usbd_setup_clear();
            }
            else if (NRF_USBD_EP_ABORTED == p_event->data.eptransfer.status)
            {
                /* Just ignore */
                kb_print("Transfer aborted event on EPOUT1");
            }
            else if (NRF_USBD_EP_WAITING == p_event->data.eptransfer.status)
            {
                nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPOUT1,
                                         &transfer_out1);
            }
            else
            {
                kb_print("Transfer failed on EPOUT1: %d", p_event->data.eptransfer.status);
                nrf_drv_usbd_setup_stall();
            }
        }
        else if (NRF_DRV_USBD_EPIN0 == p_event->data.eptransfer.ep)
        {
            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                /* Transfer ok - allow status stage */
                nrf_drv_usbd_setup_clear();
            }
            else if (NRF_USBD_EP_ABORTED == p_event->data.eptransfer.status)
            {
                /* Just ignore */
                kb_print("Transfer aborted event on EPIN0");
            }
            else
            {
                kb_print("Transfer failed on EPIN0: %d", p_event->data.eptransfer.status);
                nrf_drv_usbd_setup_stall();
            }
        }
        else if (NRF_DRV_USBD_EPOUT0 == p_event->data.eptransfer.ep)
        {
            /* NOTE: No EPOUT0 data transfers are used.
             * The code is here as a pattern how to support such a transfer. */
            if (NRF_USBD_EP_OK == p_event->data.eptransfer.status)
            {
                /* Transfer ok - allow status stage */
                nrf_drv_usbd_setup_clear();
            }
            else if (NRF_USBD_EP_ABORTED == p_event->data.eptransfer.status)
            {
                /* Just ignore */
                kb_print("Transfer aborted event on EPOUT0");
            }
            else
            {
                kb_print("Transfer failed on EPOUT0: %d", p_event->data.eptransfer.status);
                nrf_drv_usbd_setup_stall();
            }
        }
        else
        {
            /* Nothing to do */
        }
        break;
    case NRF_DRV_USBD_EVT_SETUP:
    {
        nrf_drv_usbd_setup_t setup;
        nrf_drv_usbd_setup_get(&setup);

        // kb_print("bmRequestType:%2x,bRequest:%2x,wValue:%4x",setup.bmRequestType,setup.bRequest,setup.wValue);
        if ((setup.bmRequestType & 0x80) == 0x80) // data transfer direction (Device-to-host)
        {
            // kb_print("USB Device-to-host transfer request");
            switch ((setup.bmRequestType >> 5) & 0x03)
            {
            case 0: // standard request
                // kb_print("USB standard input request");
                switch (setup.bRequest)
                {
                case 0x00: // get status
                    usbd_setup_GetStatus(&setup);
                    break;
                case 0x06: // get descriptor
                    usbd_setup_GetDescriptor(&setup);
                    break;
                case 0x08: // get configuration
                    usbd_setup_GetConfig(&setup);
                    break;
                case 0x0A: // get interface
                    kb_print("get interface");
                    break;
                case 0x0C: // synch frame
                    kb_print("synch frame");
                    break;
                default:
                    kb_print("undefined standard input request");
                    nrf_drv_usbd_setup_stall();
                    break;
                }
                break;
            case 1: // class request
                // kb_print("USB class input request");
                break;
            case 2: // vendor request
                // kb_print("USB vendor input request");
                break;
            default:
                kb_print("undefined input request");
                kb_print("bmRequestType:%2x,bRequest:%2x,wValue:%4x", setup.bmRequestType, setup.bRequest, setup.wValue);
                nrf_drv_usbd_setup_stall();
                break;
            }
        }
        else // data transfer direction (Host-to-device)
        {
            // kb_print("USB Host-to-device transfer request");
            switch ((setup.bmRequestType >> 5) & 0x03)
            {
            case 0: // standard request
                // kb_print("USB standard output request");
                switch (setup.bRequest)
                {
                case 0x01: // clear feature
                    usbd_setup_ClearFeature(&setup);
                    break;
                case 0x03: // set feature
                    usbd_setup_SetFeature(&setup);
                    break;
                case 0x05: // set address
                    kb_print("set address");
                    // nothing to do
                    break;
                case 0x07: // set desciptor
                    kb_print("set desciptor");
                    break;
                case 0x09: // set configuration
                    usbd_setup_SetConfig(&setup);
                    break;
                case 0x0B: // set interface
                    usbd_setup_SetInterface(&setup);
                    break;
                default:
                    kb_print("undefined standard output request");
                    nrf_drv_usbd_setup_stall();
                    break;
                }
                break;
            case 1: // class request
                switch (setup.bRequest)
                {
                case 0x0A: // set idle
                    usbd_setup_SetIdle(&setup);
                    break;
                case 0x0B: // set protocol
                    usbd_setup_SetProtocol(&setup);
                    break;
                default:
                    kb_print("undefined class output request");
                    kb_print("bmRequestType:%2x,bRequest:%2x,wValue:%4x", setup.bmRequestType, setup.bRequest, setup.wValue);
                    kb_print("wIndex:%2x,wLength:%2x", setup.wIndex, setup.wLength);
                    nrf_drv_usbd_setup_stall();
                    break;
                }
                break;
            case 2: // vendor request
                kb_print("USB vendor output request");
                break;
            default:
                kb_print("undefined output request");
                nrf_drv_usbd_setup_stall();
                break;
            }
        }
        break;
    }
    default:
        break;
    }
}

