AwangLL/AwangKeyboard/2-Firmware/fw-nrf52SDK/src/usb/usb_custom_service.c
void init_power_clock(void)
{
    ret_code_t err_code;
    /* Initialize power and clock. */
    err_code = nrf_drv_clock_init();
    kb_error(err_code);

    err_code = nrf_drv_power_init(NULL);
    kb_error(err_code);

    // nrf_drv_clock_hfclk_request(NULL);
    nrf_drv_clock_lfclk_request(NULL);

    // while( !(nrf_drv_clock_hfclk_is_running() && nrf_drv_clock_lfclk_is_running()) )
    while (!nrf_drv_clock_lfclk_is_running())
    {
        /* Just waiting. */
    }
}

void usb_service_init(void)
{
    ret_code_t ret;

    // log_resetreason();
    // nrf_power_resetreas_clear(nrf_power_resetreas_get());

    /* USB work starts right here */
    ret = nrf_drv_usbd_init(usbd_event_handler);
    kb_error(ret);

    /* Configure selected size of the packed on EP0 */
    nrf_drv_usbd_ep_max_packet_size_set(NRF_DRV_USBD_EPOUT0, EP0_MAXPACKETSIZE);
    nrf_drv_usbd_ep_max_packet_size_set(NRF_DRV_USBD_EPIN0, EP0_MAXPACKETSIZE);

    if (USBD_POWER_DETECTION)
    {
        static const nrf_drv_power_usbevt_config_t config =
            {
                .handler = power_usb_event_handler};
        ret = nrf_drv_power_usbevt_init(&config);
        kb_error(ret);
    }
}

void usb_event_excute(void)
{
    /* Even if we miss an event enabling USB,
     * USB event would wake us up. */
    __WFE();
    /* Clear SEV flag if CPU was woken up by event */
    __SEV();
    __WFE();
    // bsp_board_led_on(LED_RUNNING);
}

uint8_t usb_state(void)
{
    return _usb_state;
}
void usb_hid_send(uint8_t report_id, uint8_t *data)
{
    if (report_id == INPUT_REPORT_KEYBOARD_ID)
    {
        uint8_t tranData[INPUT_REPORT_LEN_KEYBOARD + 1];
        tranData[0] = report_id;
        memcpy(&tranData[1], data, INPUT_REPORT_LEN_KEYBOARD);

        nrf_drv_usbd_transfer_t transfer = {
            .p_data = {.tx = tranData},
            .size = INPUT_REPORT_LEN_KEYBOARD + 1};

        nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPIN1,
                                 &transfer);
    }
    else if (report_id == INPUT_REPORT_CONSUMER_ID)
    {
        uint8_t tranData[INPUT_REPORT_LEN_CONSUMER + 1];
        tranData[0] = report_id;
        memcpy(&tranData[1], data, INPUT_REPORT_LEN_CONSUMER);

        nrf_drv_usbd_transfer_t transfer = {
            .p_data = {.tx = tranData},
            .size = INPUT_REPORT_LEN_CONSUMER + 1};

        nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPIN1,
                                 &transfer);
    }
    else if (report_id == INPUT_REPORT_CUSTOM_ID)
    {
        uint8_t tranData[INPUT_REPORT_LEN_CUSTOM + 1];
        tranData[0] = report_id;
        memcpy(&tranData[1], data, INPUT_REPORT_LEN_CUSTOM);

        nrf_drv_usbd_transfer_t transfer = {
            .p_data = {.tx = tranData},
            .size = INPUT_REPORT_LEN_CUSTOM + 1};

        nrf_drv_usbd_ep_transfer(NRF_DRV_USBD_EPIN1,
                                 &transfer);
    }
}

/* Event Hanlder*/
static void usb_evt_hanlder(enum kbd_evt_list event, void *arg)
{
    switch (event)
    {
    case KBD_EVT_INIT:
        usb_service_init();
        kb_print("usb module initialized.");
        break;
    case KBD_EVT_SLEEP:

        kb_print("keyboard light module started.");
        break;
    default:
        break;
    }
}
EVENT_HANDLER(usb_evt_hanlder);